Tekla Open API Reference for Tekla Structures 2025
ProfileItem.ProfileItemType Property
 The profile item type.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ProfileItem.ProfileItemTypeEnum ProfileItemType { get; }
Public ReadOnly Property ProfileItemType As ProfileItem.ProfileItemTypeEnum
	Get
Property Value
Type: ProfileItem.ProfileItemTypeEnum
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace